[
    {
        "func_name": "search_method",
        "arguments": {
            "method_name": "inspectdb"
        },
        "call_ok": false
    },
    {
        "func_name": "search_class",
        "arguments": {
            "class_name": "Model"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "related_name"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code_in_file",
        "arguments": {
            "code_str": "class InspectDBCommand",
            "file_name": "django/core/management/commands/inspectdb.py"
        },
        "call_ok": false
    },
    {
        "func_name": "search_code_in_file",
        "arguments": {
            "code_str": "related_name",
            "file_name": "django/db/models/fields/related.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code_in_file",
        "arguments": {
            "code_str": "related_name",
            "file_name": "tests/invalid_models_tests/test_relative_fields.py"
        },
        "call_ok": true
    },
    {
        "func_name": "write_patch",
        "arguments": {},
        "call_ok": true
    }
]