[
    {
        "func_name": "search_class",
        "arguments": {
            "class_name": "MigrationAutodetector"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method",
        "arguments": {
            "method_name": "validate_model_fields"
        },
        "call_ok": false
    },
    {
        "func_name": "search_class",
        "arguments": {
            "class_name": "UniqueConstraint"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "E012"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code_in_file",
        "arguments": {
            "code_str": "E012",
            "file_name": "django/db/models/base.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "validate_unique_together",
            "file_name": "django/db/models/base.py"
        },
        "call_ok": false
    },
    {
        "func_name": "search_method_in_class",
        "arguments": {
            "method_name": "_check_local_fields",
            "class_name": "Model"
        },
        "call_ok": true
    },
    {
        "func_name": "write_patch",
        "arguments": {},
        "call_ok": true
    }
]