[
    [
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "save",
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "auth.0011_update_proxy_permissions"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "duplicate key value violates unique constraint"
            },
            "call_ok": false
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "proxy model permissions"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "apply"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "update_proxy_model_permissions",
                "file_name": "django/contrib/auth/migrations/0011_update_proxy_permissions.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "revert_proxy_model_permissions",
                "file_name": "django/contrib/auth/migrations/0011_update_proxy_permissions.py"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "write_patch",
            "arguments": {},
            "call_ok": true
        }
    ]
]