[
    [
        {
            "func_name": "search_class",
            "arguments": {
                "class_name": "IntegerField"
            },
            "call_ok": true
        },
        {
            "func_name": "search_class",
            "arguments": {
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "__eq__"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "__hash__"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "__lt__"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "__eq__",
                "class_name": "Field"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "__hash__",
                "class_name": "Field"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "__lt__",
                "class_name": "Field"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "write_patch",
            "arguments": {},
            "call_ok": true
        }
    ]
]