[
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "__new__",
            "file_name": "django/db/models/base.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "contribute_to_class",
            "file_name": "django/db/models/fields/__init__.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_class",
        "arguments": {
            "class_name": "ModelBase"
        },
        "call_ok": true
    },
    {
        "func_name": "search_class",
        "arguments": {
            "class_name": "Field"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "get_FOO_display()"
        },
        "call_ok": false
    },
    {
        "func_name": "search_method_in_class",
        "arguments": {
            "method_name": "_get_FIELD_display",
            "class_name": "Model"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "add_to_class"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "partialmethod"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "Field.contribute_to_class",
            "file_name": "django/db/models/fields/__init__.py"
        },
        "call_ok": false
    },
    {
        "func_name": "search_method",
        "arguments": {
            "method_name": "Field.contribute_to_class"
        },
        "call_ok": false
    },
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "_get_FIELD_display",
            "file_name": "django/db/models/base.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "flatchoices"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method_in_class",
        "arguments": {
            "method_name": "add_field",
            "class_name": "Options"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code_in_file",
        "arguments": {
            "code_str": "contribute_to_class",
            "file_name": "django/db/models/fields/related.py"
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "flatchoices ="
        },
        "call_ok": true
    },
    {
        "func_name": "search_code",
        "arguments": {
            "code_str": "field.flatchoices"
        },
        "call_ok": true
    },
    {
        "func_name": "search_method_in_file",
        "arguments": {
            "method_name": "_get_flatchoices",
            "file_name": "django/db/models/fields/__init__.py"
        },
        "call_ok": true
    },
    {
        "func_name": "write_patch",
        "arguments": {},
        "call_ok": true
    }
]