[
    [
        {
            "func_name": "search_code_in_file",
            "arguments": {
                "code_str": "Django.db.models.deletion:276-281",
                "file_name": "django/db/models/deletion.py"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "delete",
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "def delete(self"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "collector.delete()"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "post_delete"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "QuerySet.delete",
                "file_name": "django/db/models/query.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "QuerySet.delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "delete",
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "delete",
                "class_name": "QuerySet"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "post_delete signal"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "QuerySet.delete",
                "file_name": "django/db/models/query.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "QuerySet.delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "QuerySet.delete",
                "file_name": "django/db/models/query.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "QuerySet.delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "post_delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "Model.delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "Model.delete"
            },
            "call_ok": false
        }
    ],
    [
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "delete",
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "delete",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code_in_file",
            "arguments": {
                "code_str": "Collector",
                "file_name": "django/db/models/deletion.py"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "write_patch",
            "arguments": {},
            "call_ok": true
        }
    ]
]